MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
extern volatile DMACH6BITS DMACH6bits __attribute__((__sfr__));

#define DMAINT6 DMAINT6
extern volatile uint16_t DMAINT6 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT6BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT6BITS;
extern volatile DMAINT6BITS DMAINT6bits __attribute__((__sfr__));

#define DMASRC6 DMASRC6
extern volatile uint16_t DMASRC6 __attribute__((__sfr__));
#define DMADST6 DMADST6
extern volatile uint16_t DMADST6 __attribute__((__sfr__));
#define DMACNT6 DMACNT6
extern volatile uint16_t DMACNT6 __attribute__((__sfr__));
#define DMACH7 DMACH7
extern volatile uint16_t DMACH7 __attribute__((__sfr__));
__extension__ typedef struct tagDMACH7BITS {
  union {
    struct {
      uint16_t CHEN:1;
      uint16_t SIZE:1;
      uint16_t TRMODE:2;
      uint16_t DAMODE:2;
      uint16_t SAMODE:2;
      uint16_t CHREQ:1;
      uint16_t RELOAD:1;
      uint16_t NULLW:1;
    };
    struct {
      uint16_t :2;
      uint16_t TRMODE0:1;
      uint16_t TRMODE1:1;
      uint16_t DAMODE0:1;
      uint16_t DAMODE1:1;
      uint16_t SAMODE0:1;
      uint16_t SAMODE1:1;
    };
  };
} DMACH7BITS;
extern volatile DMACH7BITS DMACH7bits __attribute__((__sfr__));

#define DMAINT7 DMAINT7
extern volatile uint16_t DMAINT7 __attribute__((__sfr__));
__extension__ typedef struct tagDMAINT7BITS {
  union {
    struct {
      uint16_t HALFEN:1;
      uint16_t :2;
      uint16_t OVRUNIF:1;
      uint16_t HALFIF:1;
      uint16_t DONEIF:1;
      uint16_t LOWIF:1;
      uint16_t HIGHIF:1;
      uint16_t CHSEL:7;
      uint16_t DBUFWF:1;
    };
    struct {
      uint16_t :8;
      uint16_t CHSEL0:1;
      uint16_t CHSEL1:1;
      uint16_t CHSEL2:1;
      uint16_t CHSEL3:1;
      uint16_t CHSEL4:1;
      uint16_t CHSEL5:1;
      uint16_t CHSEL6:1;
    };
  };
} DMAINT7BITS;
extern volatile DMAINT7BITS DMAINT7bits __attribute__((__sfr__));

#define DMASRC7 DMASRC7
extern volatile uint16_t DMASRC7 __attribute__((__sfr__));
#define DMADST7 DMADST7
extern volatile uint16_t DMADST7 __attribute__((__sfr__));
#define DMACNT7 DMACNT7
extern volatile uint16_t DMACNT7 __attribute__((__sfr__));
#define U1OTGIR U1OTGIR
extern volatile uint16_t U1OTGIR __attribute__((__sfr__));
typedef struct tagU1OTGIRBITS {
  uint16_t VBUSVDIF:1;
  uint16_t :1;
  uint16_t SESENDIF:1;
  uint16_t SESVDIF:1;
  uint16_t ACTVIF:1;
  uint16_t LSTATEIF:1;
  uint16_t T1MSECIF:1;
  uint16_t IDIF:1;
} U1OTGIRBITS;
extern volatile U1OTGIRBITS U1OTGIRbits __attribute__((__sfr__));

#define U1OTGIE U1OTGIE
extern volatile uint16_t U1OTGIE __attribute__((__sfr__));
typedef struct tagU1OTGIEBITS {
  uint16_t VBUSVDIE:1;
  uint16_t :1;
  uint16_t SESENDIE:1;
  uint16_t SESVDIE:1;
  uint16_t ACTVIE:1;
  uint16_t LSTATEIE:1;
  uint16_t T1MSECIE:1;
  uint16_t IDIE:1;
} U1OTGIEBITS;
extern volatile U1OTGIEBITS U1OTGIEbits __attribute__((__sfr__));

#define U1OTGSTAT U1OTGSTAT
extern volatile uint16_t U1OTGSTAT __attribute__((__sfr__));
typedef struct tagU1OTGSTATBITS {
  uint16_t VBUSVD:1;
  uint16_t :1;
  uint16_t SESEND:1;
  uint16_t SESVD:1;
  uint16_t :1;
  uint16_t LSTATE:1;
  uint16_t :1;
  uint16_t ID:1;
} U1OTGSTATBITS;
extern volatile U1OTGSTATBITS U1OTGSTATbits __attribute__((__sfr__));

#define U1OTGCON U1OTGCON
extern volatile uint16_t U1OTGCON __attribute__((__sfr__));
typedef struct tagU1OTGCONBITS {
  uint16_t VBUSDIS:1;
  uint16_t VBUSCHG:1;
  uint16_t OTGEN:1;
  uint16_t VBUSON:1;
  uint16_t DMPULDWN:1;
  uint16_t DPPULDWN:1;
  uint16_t DMPULUP:1;
  uint16_t DPPULUP:1;
} U1OTGCONBITS;
extern volatile U1OTGCONBITS U1OTGCONbits __attribute__((__sfr__));

#define U1PWRC U1PWRC
extern volatile uint16_t U1PWRC __attribute__((__sfr__));
__extension__ typedef struct tagU1PWRCBITS {
  union {
    struct {
      uint16_t USBPWR:1;
      uint16_t USUSPND:1;
      uint16_t :2;
      uint16_t USLPGRD:1;
      uint16_t :2;
      uint16_t UACTPND:1;
    };
    struct {
      uint16_t :1;
      uint16_t USUSPEND:1;
    };
  };
} U1PWRCBITS;
extern volatile U1PWRCBITS U1PWRCbits __attribute__((__sfr__));

#define U1IR U1IR
extern volatile uint16_t U1IR __attribute__((__sfr__));
__extension__ typedef struct tagU1IRBITS {
  union {
    struct {
      uint16_t URSTIF:1;
      uint16_t UERRIF:1;
      uint16_t SOFIF:1;
      uint16_t TRNIF:1;
      uint16_t IDLEIF:1;
      uint16_t RESUMEIF:1;
      uint16_t ATTACHIF:1;
      uint16_t STALLIF:1;
    };
    struct {
      uint16_t DETACHIF:1;
    };
  };
} U1IRBITS;
extern volatile U1IRBITS U1IRbits __attribute__((__sfr__));

#define U1IE U1IE
extern volatile uint16_t U1IE __attribute__((__sfr__));
__extension__ typedef struct tagU1IEBITS {
  union {
    struct {
      uint16_t URSTIE:1;
      uint16_t UERRIE:1;
      uint16_t SOFIE:1;
      uint16_t TRNIE:1;
      uint16_t IDLEIE:1;
      uint16_t RESUMEIE:1;
      uint16_t ATTACHIE:1;
      uint16_t STALLIE:1;
    };
    struct {
      uint16_t DETACHIE:1;
    };
  };
} U1IEBITS;
extern volatile U1IEBITS U1IEbits __attribute__((__sfr__));

#define U1EIR U1EIR
extern volatile uint16_t U1EIR __attribute__((__sfr__));
__extension__ typedef struct tagU1EIRBITS {
  union {
    struct {
      uint16_t PIDEF:1;
      uint16_t CRC5EF:1;
      uint16_t CRC16EF:1;
      uint16_t DFN8EF:1;
      uint16_t BTOEF:1;
      uint16_t DMAEF:1;
      uint16_t :1;
      uint16_t BTSEF:1;
    };
    struct {
      uint16_t :1;
      uint16_t EOFEF:1;
    };
  };
} U1EIRBITS;
extern volatile U1EIRBITS U1EIRbits __attribute__((__sfr__));

#define U1EIE U1EIE
extern volatile uint16_t U1EIE __attribute__((__sfr__));
__extension__ typedef struct tagU1EIEBITS {
  union {
    struct {
      uint16_t PIDEE:1;
      uint16_t CRC5EE:1;
      uint16_t CRC16EE:1;
      uint16_t DFN8EE:1;
      uint16_t BTOEE:1;
      uint16_t DMAEE:1;
      uint16_t :1;
      uint16_t BTSEE:1;
    };
    struct {
      uint16_t :1;
      uint16_t EOFEE:1;
    };
  };
} U1EIEBITS;
extern volatile U1EIEBITS U1EIEbits __attribute__((__sfr__));

#define U1STAT U1STAT
extern volatile uint16_t U1STAT __attribute__((__sfr__));
__extension__ typedef struct tagU1STATBITS {
  union {
    struct {
      uint16_t :2;
      uint16_t PPBI:1;
      uint16_t DIR:1;
      uint16_t ENDPT:4;
    };
    struct {
      uint16_t :4;
      uint16_t ENDPT0:1;
      uint16_t ENDPT1:1;
      uint16_t ENDPT2:1;
      uint16_t ENDPT3:1;
    };
  };
} U1STATBITS;
extern volatile U1STATBITS U1STATbits __attribute__((__sfr__));

#define U1CON U1CON
extern volatile uint16_t U1CON __attribute__((__sfr__));
__extension__ typedef struct tagU1CONBITS {
  union {
    struct {
      uint16_t USBEN:1;
      uint16_t PPBRST:1;
      uint16_t RESUME:1;
      uint16_t HOSTEN:1;
      uint16_t USBRST:1;
      uint16_t PKTDIS:1;
      uint16_t SE0:1;
      uint16_t JSTATE:1;
    };
    struct {
      uint16_t SOFEN:1;
      uint16_t :3;
      uint16_t RESET:1;
      uint16_t TOKBUSY:1;
    };
  };
} U1CONBITS;
