MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t RG0:1;
  uint16_t RG1:1;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
  uint16_t :2;
  uint16_t RG12:1;
  uint16_t RG13:1;
  uint16_t RG14:1;
  uint16_t RG15:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t LATG0:1;
  uint16_t LATG1:1;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
  uint16_t :2;
  uint16_t LATG12:1;
  uint16_t LATG13:1;
  uint16_t LATG14:1;
  uint16_t LATG15:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile uint16_t ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  uint16_t ODCG0:1;
  uint16_t ODCG1:1;
  uint16_t ODCG2:1;
  uint16_t ODCG3:1;
  uint16_t :2;
  uint16_t ODCG6:1;
  uint16_t ODCG7:1;
  uint16_t ODCG8:1;
  uint16_t ODCG9:1;
  uint16_t :2;
  uint16_t ODCG12:1;
  uint16_t ODCG13:1;
  uint16_t ODCG14:1;
  uint16_t ODCG15:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
__extension__ typedef struct tagANSELGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define ANSG ANSG
extern volatile uint16_t ANSG __attribute__((__sfr__));
__extension__ typedef struct tagANSGBITS {
  union {
    struct {
      uint16_t :6;
      uint16_t ANSG6:1;
      uint16_t ANSG7:1;
      uint16_t ANSG8:1;
      uint16_t ANSG9:1;
    };
    struct {
      uint16_t :6;
      uint16_t ANSELG6:1;
      uint16_t ANSELG7:1;
      uint16_t ANSELG8:1;
      uint16_t ANSELG9:1;
    };
  };
} ANSGBITS;
extern volatile ANSGBITS ANSGbits __attribute__((__sfr__));

#define IOCPG IOCPG
extern volatile uint16_t IOCPG __attribute__((__sfr__));
typedef struct tagIOCPGBITS {
  uint16_t IOCPG0:1;
  uint16_t IOCPG1:1;
  uint16_t IOCPG2:1;
  uint16_t IOCPG3:1;
  uint16_t :2;
  uint16_t IOCPG6:1;
  uint16_t IOCPG7:1;
  uint16_t IOCPG8:1;
  uint16_t IOCPG9:1;
  uint16_t :2;
  uint16_t IOCPG12:1;
  uint16_t IOCPG13:1;
  uint16_t IOCPG14:1;
  uint16_t IOCPG15:1;
} IOCPGBITS;
extern volatile IOCPGBITS IOCPGbits __attribute__((__sfr__));

#define IOCNG IOCNG
extern volatile uint16_t IOCNG __attribute__((__sfr__));
typedef struct tagIOCNGBITS {
  uint16_t IOCNG0:1;
  uint16_t IOCNG1:1;
  uint16_t IOCNG2:1;
  uint16_t IOCNG3:1;
  uint16_t :2;
  uint16_t IOCNG6:1;
  uint16_t IOCNG7:1;
  uint16_t IOCNG8:1;
  uint16_t IOCNG9:1;
  uint16_t :2;
  uint16_t IOCNG12:1;
  uint16_t IOCNG13:1;
  uint16_t IOCNG14:1;
  uint16_t IOCNG15:1;
} IOCNGBITS;
extern volatile IOCNGBITS IOCNGbits __attribute__((__sfr__));

#define IOCFG IOCFG
extern volatile uint16_t IOCFG __attribute__((__sfr__));
typedef struct tagIOCFGBITS {
  uint16_t IOCFG0:1;
  uint16_t IOCFG1:1;
  uint16_t IOCFG2:1;
  uint16_t IOCFG3:1;
  uint16_t :2;
  uint16_t IOCFG6:1;
  uint16_t IOCFG7:1;
  uint16_t IOCFG8:1;
  uint16_t IOCFG9:1;
  uint16_t :2;
  uint16_t IOCFG12:1;
  uint16_t IOCFG13:1;
  uint16_t IOCFG14:1;
  uint16_t IOCFG15:1;
} IOCFGBITS;
extern volatile IOCFGBITS IOCFGbits __attribute__((__sfr__));

#define CNPUG CNPUG
extern volatile uint16_t CNPUG __attribute__((__sfr__));
__extension__ typedef struct tagCNPUGBITS {
  union {
    struct {
      uint16_t IOCPG0:1;
      uint16_t IOCPG1:1;
      uint16_t IOCPG2:1;
      uint16_t IOCPG3:1;
      uint16_t :2;
      uint16_t IOCPG6:1;
      uint16_t IOCPG7:1;
      uint16_t IOCPG8:1;
      uint16_t IOCPG9:1;
      uint16_t :2;
      uint16_t IOCPG12:1;
      uint16_t IOCPG13:1;
      uint16_t IOCPG14:1;
      uint16_t IOCPG15:1;
    };
    struct {
      uint16_t IOCPUG0:1;
      uint16_t IOCPUG1:1;
      uint16_t IOCPUG2:1;
      uint16_t IOCPUG3:1;
      uint16_t :2;
      uint16_t IOCPUG6:1;
      uint16_t IOCPUG7:1;
      uint16_t IOCPUG8:1;
      uint16_t IOCPUG9:1;
      uint16_t :2;
      uint16_t IOCPUG12:1;
      uint16_t IOCPUG13:1;
      uint16_t IOCPUG14:1;
      uint16_t IOCPUG15:1;
    };
    struct {
      uint16_t CNPUG0:1;
      uint16_t CNPUG1:1;
      uint16_t CNPUG2:1;
      uint16_t CNPUG3:1;
      uint16_t :2;
      uint16_t CNPUG6:1;
      uint16_t CNPUG7:1;
      uint16_t CNPUG8:1;
      uint16_t CNPUG9:1;
      uint16_t :2;
      uint16_t CNPUG12:1;
      uint16_t CNPUG13:1;
      uint16_t CNPUG14:1;
      uint16_t CNPUG15:1;
    };
  };
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define IOCPUG IOCPUG
extern volatile uint16_t IOCPUG __attribute__((__sfr__));
__extension__ typedef struct tagIOCPUGBITS {
  union {
    struct {
      uint16_t IOCPG0:1;
      uint16_t IOCPG1:1;
      uint16_t IOCPG2:1;
      uint16_t IOCPG3:1;
      uint16_t :2;
      uint16_t IOCPG6:1;
      uint16_t IOCPG7:1;
      uint16_t IOCPG8:1;
      uint16_t IOCPG9:1;
      uint16_t :2;
      uint16_t IOCPG12:1;
      uint16_t IOCPG13:1;
      uint16_t IOCPG14:1;
      uint16_t IOCPG15:1;
    };
    struct {
      uint16_t IOCPUG0:1;
      uint16_t IOCPUG1:1;
      uint16_t IOCPUG2:1;
      uint16_t IOCPUG3:1;
      uint16_t :2;
      uint16_t IOCPUG6:1;
      uint16_t IOCPUG7:1;
      uint16_t IOCPUG8:1;
      uint16_t IOCPUG9:1;
      uint16_t :2;
      uint16_t IOCPUG12:1;
      uint16_t IOCPUG13:1;
      uint16_t IOCPUG14:1;
      uint16_t IOCPUG15:1;
    };
    struct {
      uint16_t CNPUG0:1;
      uint16_t CNPUG1:1;
      uint16_t CNPUG2:1;
      uint16_t CNPUG3:1;
      uint16_t :2;
      uint16_t CNPUG6:1;
      uint16_t CNPUG7:1;
      uint16_t CNPUG8:1;
      uint16_t CNPUG9:1;
      uint16_t :2;
      uint16_t CNPUG12:1;
      uint16_t CNPUG13:1;
      uint16_t CNPUG14:1;
      uint16_t CNPUG15:1;
    };
  };
} IOCPUGBITS;
extern volatile IOCPUGBITS IOCPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile uint16_t CNPDG __attribute__((__sfr__));
__extension__ typedef struct tagCNPDGBITS {
  union {
    struct {
      uint16_t IOCPDG0:1;
      uint16_t IOCPDG1:1;
      uint16_t IOCPDG2:1;
      uint16_t IOCPDG3:1;
      uint16_t :2;
      uint16_t IOCPDG6:1;
      uint16_t IOCPDG7:1;
      uint16_t IOCPDG8:1;
      uint16_t IOCPDG9:1;
      uint16_t :2;
      uint16_t IOCPDG12:1;
      uint16_t IOCPDG13:1;
      uint16_t IOCPDG14:1;
      uint16_t IOCPDG15:1;
    };
    struct {
      uint16_t CNPDG0:1;
      uint16_t CNPDG1:1;
      uint16_t CNPDG2:1;
      uint16_t CNPDG3:1;
      uint16_t :2;
      uint16_t CNPDG6:1;
      uint16_t CNPDG7:1;
      uint16_t CNPDG8:1;
      uint16_t CNPDG9:1;
      uint16_t :2;
      uint16_t CNPDG12:1;
      uint16_t CNPDG13:1;
      uint16_t CNPDG14:1;
      uint16_t CNPDG15:1;
    };
  };
} CNPDGBITS;
