MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
/* CNPUA */
/* Bitname _IOCPA0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPA15 cannot be defined because it is used by more than one SFR */
#define _IOCPUA0 CNPUAbits.IOCPUA0
#define _IOCPUA1 CNPUAbits.IOCPUA1
#define _IOCPUA2 CNPUAbits.IOCPUA2
#define _IOCPUA3 CNPUAbits.IOCPUA3
#define _IOCPUA4 CNPUAbits.IOCPUA4
#define _IOCPUA5 CNPUAbits.IOCPUA5
#define _IOCPUA6 CNPUAbits.IOCPUA6
#define _IOCPUA7 CNPUAbits.IOCPUA7
#define _IOCPUA9 CNPUAbits.IOCPUA9
#define _IOCPUA10 CNPUAbits.IOCPUA10
#define _IOCPUA14 CNPUAbits.IOCPUA14
#define _IOCPUA15 CNPUAbits.IOCPUA15
#define _CNPUA0 CNPUAbits.CNPUA0
#define _CNPUA1 CNPUAbits.CNPUA1
#define _CNPUA2 CNPUAbits.CNPUA2
#define _CNPUA3 CNPUAbits.CNPUA3
#define _CNPUA4 CNPUAbits.CNPUA4
#define _CNPUA5 CNPUAbits.CNPUA5
#define _CNPUA6 CNPUAbits.CNPUA6
#define _CNPUA7 CNPUAbits.CNPUA7
#define _CNPUA9 CNPUAbits.CNPUA9
#define _CNPUA10 CNPUAbits.CNPUA10
#define _CNPUA14 CNPUAbits.CNPUA14
#define _CNPUA15 CNPUAbits.CNPUA15

/* CNPDA */
#define _IOCPDA0 CNPDAbits.IOCPDA0
#define _IOCPDA1 CNPDAbits.IOCPDA1
#define _IOCPDA2 CNPDAbits.IOCPDA2
#define _IOCPDA3 CNPDAbits.IOCPDA3
#define _IOCPDA4 CNPDAbits.IOCPDA4
#define _IOCPDA5 CNPDAbits.IOCPDA5
#define _IOCPDA6 CNPDAbits.IOCPDA6
#define _IOCPDA7 CNPDAbits.IOCPDA7
#define _IOCPDA9 CNPDAbits.IOCPDA9
#define _IOCPDA10 CNPDAbits.IOCPDA10
#define _IOCPDA14 CNPDAbits.IOCPDA14
#define _IOCPDA15 CNPDAbits.IOCPDA15
#define _CNPDA0 CNPDAbits.CNPDA0
#define _CNPDA1 CNPDAbits.CNPDA1
#define _CNPDA2 CNPDAbits.CNPDA2
#define _CNPDA3 CNPDAbits.CNPDA3
#define _CNPDA4 CNPDAbits.CNPDA4
#define _CNPDA5 CNPDAbits.CNPDA5
#define _CNPDA6 CNPDAbits.CNPDA6
#define _CNPDA7 CNPDAbits.CNPDA7
#define _CNPDA9 CNPDAbits.CNPDA9
#define _CNPDA10 CNPDAbits.CNPDA10
#define _CNPDA14 CNPDAbits.CNPDA14
#define _CNPDA15 CNPDAbits.CNPDA15

/* TRISB */
#define _TRISB0 TRISBbits.TRISB0
#define _TRISB1 TRISBbits.TRISB1
#define _TRISB2 TRISBbits.TRISB2
#define _TRISB3 TRISBbits.TRISB3
#define _TRISB4 TRISBbits.TRISB4
#define _TRISB5 TRISBbits.TRISB5
#define _TRISB6 TRISBbits.TRISB6
#define _TRISB7 TRISBbits.TRISB7
#define _TRISB8 TRISBbits.TRISB8
#define _TRISB9 TRISBbits.TRISB9
#define _TRISB10 TRISBbits.TRISB10
#define _TRISB11 TRISBbits.TRISB11
#define _TRISB12 TRISBbits.TRISB12
#define _TRISB13 TRISBbits.TRISB13
#define _TRISB14 TRISBbits.TRISB14
#define _TRISB15 TRISBbits.TRISB15

/* PORTB */
#define _RB0 PORTBbits.RB0
#define _RB1 PORTBbits.RB1
#define _RB2 PORTBbits.RB2
#define _RB3 PORTBbits.RB3
#define _RB4 PORTBbits.RB4
#define _RB5 PORTBbits.RB5
#define _RB6 PORTBbits.RB6
#define _RB7 PORTBbits.RB7
#define _RB8 PORTBbits.RB8
#define _RB9 PORTBbits.RB9
#define _RB10 PORTBbits.RB10
#define _RB11 PORTBbits.RB11
#define _RB12 PORTBbits.RB12
#define _RB13 PORTBbits.RB13
#define _RB14 PORTBbits.RB14
#define _RB15 PORTBbits.RB15

/* LATB */
#define _LATB0 LATBbits.LATB0
#define _LATB1 LATBbits.LATB1
#define _LATB2 LATBbits.LATB2
#define _LATB3 LATBbits.LATB3
#define _LATB4 LATBbits.LATB4
#define _LATB5 LATBbits.LATB5
#define _LATB6 LATBbits.LATB6
#define _LATB7 LATBbits.LATB7
#define _LATB8 LATBbits.LATB8
#define _LATB9 LATBbits.LATB9
#define _LATB10 LATBbits.LATB10
#define _LATB11 LATBbits.LATB11
#define _LATB12 LATBbits.LATB12
#define _LATB13 LATBbits.LATB13
#define _LATB14 LATBbits.LATB14
#define _LATB15 LATBbits.LATB15

/* ODCB */
#define _ODCB0 ODCBbits.ODCB0
#define _ODCB1 ODCBbits.ODCB1
#define _ODCB2 ODCBbits.ODCB2
#define _ODCB3 ODCBbits.ODCB3
#define _ODCB4 ODCBbits.ODCB4
#define _ODCB5 ODCBbits.ODCB5
#define _ODCB6 ODCBbits.ODCB6
#define _ODCB7 ODCBbits.ODCB7
#define _ODCB8 ODCBbits.ODCB8
#define _ODCB9 ODCBbits.ODCB9
#define _ODCB10 ODCBbits.ODCB10
#define _ODCB11 ODCBbits.ODCB11
#define _ODCB12 ODCBbits.ODCB12
#define _ODCB13 ODCBbits.ODCB13
#define _ODCB14 ODCBbits.ODCB14
#define _ODCB15 ODCBbits.ODCB15

/* ANSB */
#define _ANSB0 ANSBbits.ANSB0
#define _ANSB1 ANSBbits.ANSB1
#define _ANSB2 ANSBbits.ANSB2
#define _ANSB3 ANSBbits.ANSB3
#define _ANSB4 ANSBbits.ANSB4
#define _ANSB5 ANSBbits.ANSB5
#define _ANSB6 ANSBbits.ANSB6
#define _ANSB7 ANSBbits.ANSB7
#define _ANSB8 ANSBbits.ANSB8
#define _ANSB9 ANSBbits.ANSB9
#define _ANSB10 ANSBbits.ANSB10
#define _ANSB11 ANSBbits.ANSB11
#define _ANSB12 ANSBbits.ANSB12
#define _ANSB13 ANSBbits.ANSB13
#define _ANSB14 ANSBbits.ANSB14
#define _ANSB15 ANSBbits.ANSB15
#define _ANSELB0 ANSBbits.ANSELB0
#define _ANSELB1 ANSBbits.ANSELB1
#define _ANSELB2 ANSBbits.ANSELB2
#define _ANSELB3 ANSBbits.ANSELB3
#define _ANSELB4 ANSBbits.ANSELB4
#define _ANSELB5 ANSBbits.ANSELB5
#define _ANSELB6 ANSBbits.ANSELB6
#define _ANSELB7 ANSBbits.ANSELB7
#define _ANSELB8 ANSBbits.ANSELB8
#define _ANSELB9 ANSBbits.ANSELB9
#define _ANSELB10 ANSBbits.ANSELB10
#define _ANSELB11 ANSBbits.ANSELB11
#define _ANSELB12 ANSBbits.ANSELB12
#define _ANSELB13 ANSBbits.ANSELB13
#define _ANSELB14 ANSBbits.ANSELB14
#define _ANSELB15 ANSBbits.ANSELB15

/* IOCPB */
/* Bitname _IOCPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB15 cannot be defined because it is used by more than one SFR */

