MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _IFS5_USB1IF_POSITION                    0x00000006
#define _IFS5_USB1IF_MASK                        0x00000040
#define _IFS5_USB1IF_LENGTH                      0x00000001

#define _IFS5_U4ERIF_POSITION                    0x00000007
#define _IFS5_U4ERIF_MASK                        0x00000080
#define _IFS5_U4ERIF_LENGTH                      0x00000001

#define _IFS5_U4RXIF_POSITION                    0x00000008
#define _IFS5_U4RXIF_MASK                        0x00000100
#define _IFS5_U4RXIF_LENGTH                      0x00000001

#define _IFS5_U4TXIF_POSITION                    0x00000009
#define _IFS5_U4TXIF_MASK                        0x00000200
#define _IFS5_U4TXIF_LENGTH                      0x00000001

#define _IFS5_SPI3IF_POSITION                    0x0000000A
#define _IFS5_SPI3IF_MASK                        0x00000400
#define _IFS5_SPI3IF_LENGTH                      0x00000001

#define _IFS5_SPI3TXIF_POSITION                  0x0000000B
#define _IFS5_SPI3TXIF_MASK                      0x00000800
#define _IFS5_SPI3TXIF_LENGTH                    0x00000001

#define _IFS5_CCP3IF_POSITION                    0x0000000E
#define _IFS5_CCP3IF_MASK                        0x00004000
#define _IFS5_CCP3IF_LENGTH                      0x00000001

#define _IFS5_CCP4IF_POSITION                    0x0000000F
#define _IFS5_CCP4IF_MASK                        0x00008000
#define _IFS5_CCP4IF_LENGTH                      0x00000001

#define _IFS6_CLC1IF_POSITION                    0x00000000
#define _IFS6_CLC1IF_MASK                        0x00000001
#define _IFS6_CLC1IF_LENGTH                      0x00000001

#define _IFS6_CLC2IF_POSITION                    0x00000001
#define _IFS6_CLC2IF_MASK                        0x00000002
#define _IFS6_CLC2IF_LENGTH                      0x00000001

#define _IFS6_CLC3IF_POSITION                    0x00000002
#define _IFS6_CLC3IF_MASK                        0x00000004
#define _IFS6_CLC3IF_LENGTH                      0x00000001

#define _IFS6_CLC4IF_POSITION                    0x00000003
#define _IFS6_CLC4IF_MASK                        0x00000008
#define _IFS6_CLC4IF_LENGTH                      0x00000001

#define _IFS6_CCT1IF_POSITION                    0x00000005
#define _IFS6_CCT1IF_MASK                        0x00000020
#define _IFS6_CCT1IF_LENGTH                      0x00000001

#define _IFS6_CCT2IF_POSITION                    0x00000006
#define _IFS6_CCT2IF_MASK                        0x00000040
#define _IFS6_CCT2IF_LENGTH                      0x00000001

#define _IFS6_FSTIF_POSITION                     0x0000000A
#define _IFS6_FSTIF_MASK                         0x00000400
#define _IFS6_FSTIF_LENGTH                       0x00000001

#define _IFS6_I2C3BCIF_POSITION                  0x0000000D
#define _IFS6_I2C3BCIF_MASK                      0x00002000
#define _IFS6_I2C3BCIF_LENGTH                    0x00000001

#define _IFS6_RTCCTSIF_POSITION                  0x0000000E
#define _IFS6_RTCCTSIF_MASK                      0x00004000
#define _IFS6_RTCCTSIF_LENGTH                    0x00000001

#define _IFS6_U5RXIF_POSITION                    0x0000000F
#define _IFS6_U5RXIF_MASK                        0x00008000
#define _IFS6_U5RXIF_LENGTH                      0x00000001

#define _IFS7_U5TXIF_POSITION                    0x00000000
#define _IFS7_U5TXIF_MASK                        0x00000001
#define _IFS7_U5TXIF_LENGTH                      0x00000001

#define _IFS7_U5ERIF_POSITION                    0x00000001
#define _IFS7_U5ERIF_MASK                        0x00000002
#define _IFS7_U5ERIF_LENGTH                      0x00000001

#define _IFS7_U6RXIF_POSITION                    0x00000002
#define _IFS7_U6RXIF_MASK                        0x00000004
#define _IFS7_U6RXIF_LENGTH                      0x00000001

#define _IFS7_U6TXIF_POSITION                    0x00000003
#define _IFS7_U6TXIF_MASK                        0x00000008
#define _IFS7_U6TXIF_LENGTH                      0x00000001

#define _IFS7_U6ERIF_POSITION                    0x00000004
#define _IFS7_U6ERIF_MASK                        0x00000010
#define _IFS7_U6ERIF_LENGTH                      0x00000001

#define _IFS7_JTAGIF_POSITION                    0x00000005
#define _IFS7_JTAGIF_MASK                        0x00000020
#define _IFS7_JTAGIF_LENGTH                      0x00000001

#define _IEC0_INT0IE_POSITION                    0x00000000
#define _IEC0_INT0IE_MASK                        0x00000001
#define _IEC0_INT0IE_LENGTH                      0x00000001

#define _IEC0_IC1IE_POSITION                     0x00000001
#define _IEC0_IC1IE_MASK                         0x00000002
#define _IEC0_IC1IE_LENGTH                       0x00000001

#define _IEC0_OC1IE_POSITION                     0x00000002
#define _IEC0_OC1IE_MASK                         0x00000004
#define _IEC0_OC1IE_LENGTH                       0x00000001

#define _IEC0_T1IE_POSITION                      0x00000003
#define _IEC0_T1IE_MASK                          0x00000008
#define _IEC0_T1IE_LENGTH                        0x00000001

#define _IEC0_DMA0IE_POSITION                    0x00000004
#define _IEC0_DMA0IE_MASK                        0x00000010
#define _IEC0_DMA0IE_LENGTH                      0x00000001

#define _IEC0_IC2IE_POSITION                     0x00000005
#define _IEC0_IC2IE_MASK                         0x00000020
#define _IEC0_IC2IE_LENGTH                       0x00000001

#define _IEC0_OC2IE_POSITION                     0x00000006
#define _IEC0_OC2IE_MASK                         0x00000040
#define _IEC0_OC2IE_LENGTH                       0x00000001

#define _IEC0_T2IE_POSITION                      0x00000007
#define _IEC0_T2IE_MASK                          0x00000080
#define _IEC0_T2IE_LENGTH                        0x00000001

#define _IEC0_T3IE_POSITION                      0x00000008
#define _IEC0_T3IE_MASK                          0x00000100
#define _IEC0_T3IE_LENGTH                        0x00000001

#define _IEC0_SPI1IE_POSITION                    0x00000009
#define _IEC0_SPI1IE_MASK                        0x00000200
#define _IEC0_SPI1IE_LENGTH                      0x00000001

