MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _PMCON3_AWAITM0_POSITION                 0x00000009
#define _PMCON3_AWAITM0_MASK                     0x00000200
#define _PMCON3_AWAITM0_LENGTH                   0x00000001

#define _PMCON3_AWAITM1_POSITION                 0x0000000A
#define _PMCON3_AWAITM1_MASK                     0x00000400
#define _PMCON3_AWAITM1_LENGTH                   0x00000001

#define _PMCON4_PTEN0_POSITION                   0x00000000
#define _PMCON4_PTEN0_MASK                       0x00000001
#define _PMCON4_PTEN0_LENGTH                     0x00000001

#define _PMCON4_PTEN1_POSITION                   0x00000001
#define _PMCON4_PTEN1_MASK                       0x00000002
#define _PMCON4_PTEN1_LENGTH                     0x00000001

#define _PMCON4_PTEN2_POSITION                   0x00000002
#define _PMCON4_PTEN2_MASK                       0x00000004
#define _PMCON4_PTEN2_LENGTH                     0x00000001

#define _PMCON4_PTEN3_POSITION                   0x00000003
#define _PMCON4_PTEN3_MASK                       0x00000008
#define _PMCON4_PTEN3_LENGTH                     0x00000001

#define _PMCON4_PTEN4_POSITION                   0x00000004
#define _PMCON4_PTEN4_MASK                       0x00000010
#define _PMCON4_PTEN4_LENGTH                     0x00000001

#define _PMCON4_PTEN5_POSITION                   0x00000005
#define _PMCON4_PTEN5_MASK                       0x00000020
#define _PMCON4_PTEN5_LENGTH                     0x00000001

#define _PMCON4_PTEN6_POSITION                   0x00000006
#define _PMCON4_PTEN6_MASK                       0x00000040
#define _PMCON4_PTEN6_LENGTH                     0x00000001

#define _PMCON4_PTEN7_POSITION                   0x00000007
#define _PMCON4_PTEN7_MASK                       0x00000080
#define _PMCON4_PTEN7_LENGTH                     0x00000001

#define _PMCON4_PTEN8_POSITION                   0x00000008
#define _PMCON4_PTEN8_MASK                       0x00000100
#define _PMCON4_PTEN8_LENGTH                     0x00000001

#define _PMCON4_PTEN9_POSITION                   0x00000009
#define _PMCON4_PTEN9_MASK                       0x00000200
#define _PMCON4_PTEN9_LENGTH                     0x00000001

#define _PMCON4_PTEN10_POSITION                  0x0000000A
#define _PMCON4_PTEN10_MASK                      0x00000400
#define _PMCON4_PTEN10_LENGTH                    0x00000001

#define _PMCON4_PTEN11_POSITION                  0x0000000B
#define _PMCON4_PTEN11_MASK                      0x00000800
#define _PMCON4_PTEN11_LENGTH                    0x00000001

#define _PMCON4_PTEN12_POSITION                  0x0000000C
#define _PMCON4_PTEN12_MASK                      0x00001000
#define _PMCON4_PTEN12_LENGTH                    0x00000001

#define _PMCON4_PTEN13_POSITION                  0x0000000D
#define _PMCON4_PTEN13_MASK                      0x00002000
#define _PMCON4_PTEN13_LENGTH                    0x00000001

#define _PMCON4_PTEN14_POSITION                  0x0000000E
#define _PMCON4_PTEN14_MASK                      0x00004000
#define _PMCON4_PTEN14_LENGTH                    0x00000001

#define _PMCON4_PTEN15_POSITION                  0x0000000F
#define _PMCON4_PTEN15_MASK                      0x00008000
#define _PMCON4_PTEN15_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ_POSITION                   0x00000005
#define _PMCS1CF_PTSZ_MASK                       0x00000060
#define _PMCS1CF_PTSZ_LENGTH                     0x00000002

#define _PMCS1CF_ACKP_POSITION                   0x00000007
#define _PMCS1CF_ACKP_MASK                       0x00000080
#define _PMCS1CF_ACKP_LENGTH                     0x00000001

#define _PMCS1CF_SM_POSITION                     0x00000008
#define _PMCS1CF_SM_MASK                         0x00000100
#define _PMCS1CF_SM_LENGTH                       0x00000001

#define _PMCS1CF_RDSP_POSITION                   0x00000009
#define _PMCS1CF_RDSP_MASK                       0x00000200
#define _PMCS1CF_RDSP_LENGTH                     0x00000001

#define _PMCS1CF_WRSP_POSITION                   0x0000000A
#define _PMCS1CF_WRSP_MASK                       0x00000400
#define _PMCS1CF_WRSP_LENGTH                     0x00000001

#define _PMCS1CF_BEP_POSITION                    0x0000000C
#define _PMCS1CF_BEP_MASK                        0x00001000
#define _PMCS1CF_BEP_LENGTH                      0x00000001

#define _PMCS1CF_CSPTEN_POSITION                 0x0000000D
#define _PMCS1CF_CSPTEN_MASK                     0x00002000
#define _PMCS1CF_CSPTEN_LENGTH                   0x00000001

#define _PMCS1CF_CSP_POSITION                    0x0000000E
#define _PMCS1CF_CSP_MASK                        0x00004000
#define _PMCS1CF_CSP_LENGTH                      0x00000001

#define _PMCS1CF_CSDIS_POSITION                  0x0000000F
#define _PMCS1CF_CSDIS_MASK                      0x00008000
#define _PMCS1CF_CSDIS_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ0_POSITION                  0x00000005
#define _PMCS1CF_PTSZ0_MASK                      0x00000020
#define _PMCS1CF_PTSZ0_LENGTH                    0x00000001

#define _PMCS1CF_PTSZ1_POSITION                  0x00000006
#define _PMCS1CF_PTSZ1_MASK                      0x00000040
#define _PMCS1CF_PTSZ1_LENGTH                    0x00000001

#define _PMCS1BS_BASE11_POSITION                 0x00000003
#define _PMCS1BS_BASE11_MASK                     0x00000008
#define _PMCS1BS_BASE11_LENGTH                   0x00000001

#define _PMCS1BS_BASE15_POSITION                 0x00000007
#define _PMCS1BS_BASE15_MASK                     0x00000080
#define _PMCS1BS_BASE15_LENGTH                   0x00000001

#define _PMCS1BS_BASE16_POSITION                 0x00000008
#define _PMCS1BS_BASE16_MASK                     0x00000100
#define _PMCS1BS_BASE16_LENGTH                   0x00000001

#define _PMCS1BS_BASE17_POSITION                 0x00000009
#define _PMCS1BS_BASE17_MASK                     0x00000200
#define _PMCS1BS_BASE17_LENGTH                   0x00000001

#define _PMCS1BS_BASE18_POSITION                 0x0000000A
#define _PMCS1BS_BASE18_MASK                     0x00000400
#define _PMCS1BS_BASE18_LENGTH                   0x00000001

