MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _OC6CON2_OCTRIG_POSITION                 0x00000007
#define _OC6CON2_OCTRIG_MASK                     0x00000080
#define _OC6CON2_OCTRIG_LENGTH                   0x00000001

#define _OC6CON2_OC32_POSITION                   0x00000008
#define _OC6CON2_OC32_MASK                       0x00000100
#define _OC6CON2_OC32_LENGTH                     0x00000001

#define _OC6CON2_DCB_POSITION                    0x00000009
#define _OC6CON2_DCB_MASK                        0x00000600
#define _OC6CON2_DCB_LENGTH                      0x00000002

#define _OC6CON2_OCINV_POSITION                  0x0000000C
#define _OC6CON2_OCINV_MASK                      0x00001000
#define _OC6CON2_OCINV_LENGTH                    0x00000001

#define _OC6CON2_FLTTRIEN_POSITION               0x0000000D
#define _OC6CON2_FLTTRIEN_MASK                   0x00002000
#define _OC6CON2_FLTTRIEN_LENGTH                 0x00000001

#define _OC6CON2_FLTOUT_POSITION                 0x0000000E
#define _OC6CON2_FLTOUT_MASK                     0x00004000
#define _OC6CON2_FLTOUT_LENGTH                   0x00000001

#define _OC6CON2_FLTMD_POSITION                  0x0000000F
#define _OC6CON2_FLTMD_MASK                      0x00008000
#define _OC6CON2_FLTMD_LENGTH                    0x00000001

#define _OC6CON2_SYNCSEL0_POSITION               0x00000000
#define _OC6CON2_SYNCSEL0_MASK                   0x00000001
#define _OC6CON2_SYNCSEL0_LENGTH                 0x00000001

#define _OC6CON2_SYNCSEL1_POSITION               0x00000001
#define _OC6CON2_SYNCSEL1_MASK                   0x00000002
#define _OC6CON2_SYNCSEL1_LENGTH                 0x00000001

#define _OC6CON2_SYNCSEL2_POSITION               0x00000002
#define _OC6CON2_SYNCSEL2_MASK                   0x00000004
#define _OC6CON2_SYNCSEL2_LENGTH                 0x00000001

#define _OC6CON2_SYNCSEL3_POSITION               0x00000003
#define _OC6CON2_SYNCSEL3_MASK                   0x00000008
#define _OC6CON2_SYNCSEL3_LENGTH                 0x00000001

#define _OC6CON2_SYNCSEL4_POSITION               0x00000004
#define _OC6CON2_SYNCSEL4_MASK                   0x00000010
#define _OC6CON2_SYNCSEL4_LENGTH                 0x00000001

#define _OC6CON2_DCB0_POSITION                   0x00000009
#define _OC6CON2_DCB0_MASK                       0x00000200
#define _OC6CON2_DCB0_LENGTH                     0x00000001

#define _OC6CON2_DCB1_POSITION                   0x0000000A
#define _OC6CON2_DCB1_MASK                       0x00000400
#define _OC6CON2_DCB1_LENGTH                     0x00000001

#define _OC6CON2_FLTMODE_POSITION                0x0000000E
#define _OC6CON2_FLTMODE_MASK                    0x00004000
#define _OC6CON2_FLTMODE_LENGTH                  0x00000001

#define _CCP1CON1L_MOD_POSITION                  0x00000000
#define _CCP1CON1L_MOD_MASK                      0x0000000F
#define _CCP1CON1L_MOD_LENGTH                    0x00000004

#define _CCP1CON1L_CCSEL_POSITION                0x00000004
#define _CCP1CON1L_CCSEL_MASK                    0x00000010
#define _CCP1CON1L_CCSEL_LENGTH                  0x00000001

#define _CCP1CON1L_T32_POSITION                  0x00000005
#define _CCP1CON1L_T32_MASK                      0x00000020
#define _CCP1CON1L_T32_LENGTH                    0x00000001

#define _CCP1CON1L_TMRPS_POSITION                0x00000006
#define _CCP1CON1L_TMRPS_MASK                    0x000000C0
#define _CCP1CON1L_TMRPS_LENGTH                  0x00000002

#define _CCP1CON1L_CLKSEL_POSITION               0x00000008
#define _CCP1CON1L_CLKSEL_MASK                   0x00000700
#define _CCP1CON1L_CLKSEL_LENGTH                 0x00000003

#define _CCP1CON1L_TMRSYNC_POSITION              0x0000000B
#define _CCP1CON1L_TMRSYNC_MASK                  0x00000800
#define _CCP1CON1L_TMRSYNC_LENGTH                0x00000001

#define _CCP1CON1L_CCPSLP_POSITION               0x0000000C
#define _CCP1CON1L_CCPSLP_MASK                   0x00001000
#define _CCP1CON1L_CCPSLP_LENGTH                 0x00000001

#define _CCP1CON1L_CCPSIDL_POSITION              0x0000000D
#define _CCP1CON1L_CCPSIDL_MASK                  0x00002000
#define _CCP1CON1L_CCPSIDL_LENGTH                0x00000001

#define _CCP1CON1L_CCPON_POSITION                0x0000000F
#define _CCP1CON1L_CCPON_MASK                    0x00008000
#define _CCP1CON1L_CCPON_LENGTH                  0x00000001

#define _CCP1CON1L_MOD0_POSITION                 0x00000000
#define _CCP1CON1L_MOD0_MASK                     0x00000001
#define _CCP1CON1L_MOD0_LENGTH                   0x00000001

#define _CCP1CON1L_MOD1_POSITION                 0x00000001
#define _CCP1CON1L_MOD1_MASK                     0x00000002
#define _CCP1CON1L_MOD1_LENGTH                   0x00000001

#define _CCP1CON1L_MOD2_POSITION                 0x00000002
#define _CCP1CON1L_MOD2_MASK                     0x00000004
#define _CCP1CON1L_MOD2_LENGTH                   0x00000001

#define _CCP1CON1L_MOD3_POSITION                 0x00000003
#define _CCP1CON1L_MOD3_MASK                     0x00000008
#define _CCP1CON1L_MOD3_LENGTH                   0x00000001

#define _CCP1CON1L_TMR32_POSITION                0x00000005
#define _CCP1CON1L_TMR32_MASK                    0x00000020
#define _CCP1CON1L_TMR32_LENGTH                  0x00000001

#define _CCP1CON1L_TMRPS0_POSITION               0x00000006
#define _CCP1CON1L_TMRPS0_MASK                   0x00000040
#define _CCP1CON1L_TMRPS0_LENGTH                 0x00000001

#define _CCP1CON1L_TMRPS1_POSITION               0x00000007
#define _CCP1CON1L_TMRPS1_MASK                   0x00000080
#define _CCP1CON1L_TMRPS1_LENGTH                 0x00000001

#define _CCP1CON1L_CLKSEL0_POSITION              0x00000008
#define _CCP1CON1L_CLKSEL0_MASK                  0x00000100
#define _CCP1CON1L_CLKSEL0_LENGTH                0x00000001

#define _CCP1CON1L_CLKSEL1_POSITION              0x00000009
#define _CCP1CON1L_CLKSEL1_MASK                  0x00000200
#define _CCP1CON1L_CLKSEL1_LENGTH                0x00000001

#define _CCP1CON1L_CLKSEL2_POSITION              0x0000000A
#define _CCP1CON1L_CLKSEL2_MASK                  0x00000400
#define _CCP1CON1L_CLKSEL2_LENGTH                0x00000001

