MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _I2C2CON1_RSEN_POSITION                  0x00000001
#define _I2C2CON1_RSEN_MASK                      0x00000002
#define _I2C2CON1_RSEN_LENGTH                    0x00000001

#define _I2C2CON1_PEN_POSITION                   0x00000002
#define _I2C2CON1_PEN_MASK                       0x00000004
#define _I2C2CON1_PEN_LENGTH                     0x00000001

#define _I2C2CON1_RCEN_POSITION                  0x00000003
#define _I2C2CON1_RCEN_MASK                      0x00000008
#define _I2C2CON1_RCEN_LENGTH                    0x00000001

#define _I2C2CON1_ACKEN_POSITION                 0x00000004
#define _I2C2CON1_ACKEN_MASK                     0x00000010
#define _I2C2CON1_ACKEN_LENGTH                   0x00000001

#define _I2C2CON1_ACKDT_POSITION                 0x00000005
#define _I2C2CON1_ACKDT_MASK                     0x00000020
#define _I2C2CON1_ACKDT_LENGTH                   0x00000001

#define _I2C2CON1_STREN_POSITION                 0x00000006
#define _I2C2CON1_STREN_MASK                     0x00000040
#define _I2C2CON1_STREN_LENGTH                   0x00000001

#define _I2C2CON1_GCEN_POSITION                  0x00000007
#define _I2C2CON1_GCEN_MASK                      0x00000080
#define _I2C2CON1_GCEN_LENGTH                    0x00000001

#define _I2C2CON1_SMEN_POSITION                  0x00000008
#define _I2C2CON1_SMEN_MASK                      0x00000100
#define _I2C2CON1_SMEN_LENGTH                    0x00000001

#define _I2C2CON1_DISSLW_POSITION                0x00000009
#define _I2C2CON1_DISSLW_MASK                    0x00000200
#define _I2C2CON1_DISSLW_LENGTH                  0x00000001

#define _I2C2CON1_A10M_POSITION                  0x0000000A
#define _I2C2CON1_A10M_MASK                      0x00000400
#define _I2C2CON1_A10M_LENGTH                    0x00000001

#define _I2C2CON1_STRICT_POSITION                0x0000000B
#define _I2C2CON1_STRICT_MASK                    0x00000800
#define _I2C2CON1_STRICT_LENGTH                  0x00000001

#define _I2C2CON1_SCLREL_POSITION                0x0000000C
#define _I2C2CON1_SCLREL_MASK                    0x00001000
#define _I2C2CON1_SCLREL_LENGTH                  0x00000001

#define _I2C2CON1_I2CSIDL_POSITION               0x0000000D
#define _I2C2CON1_I2CSIDL_MASK                   0x00002000
#define _I2C2CON1_I2CSIDL_LENGTH                 0x00000001

#define _I2C2CON1_I2CEN_POSITION                 0x0000000F
#define _I2C2CON1_I2CEN_MASK                     0x00008000
#define _I2C2CON1_I2CEN_LENGTH                   0x00000001

#define _I2C2CON1_SIDL_POSITION                  0x0000000D
#define _I2C2CON1_SIDL_MASK                      0x00002000
#define _I2C2CON1_SIDL_LENGTH                    0x00000001

#define _I2C2CONL_SEN_POSITION                   0x00000000
#define _I2C2CONL_SEN_MASK                       0x00000001
#define _I2C2CONL_SEN_LENGTH                     0x00000001

#define _I2C2CONL_RSEN_POSITION                  0x00000001
#define _I2C2CONL_RSEN_MASK                      0x00000002
#define _I2C2CONL_RSEN_LENGTH                    0x00000001

#define _I2C2CONL_PEN_POSITION                   0x00000002
#define _I2C2CONL_PEN_MASK                       0x00000004
#define _I2C2CONL_PEN_LENGTH                     0x00000001

#define _I2C2CONL_RCEN_POSITION                  0x00000003
#define _I2C2CONL_RCEN_MASK                      0x00000008
#define _I2C2CONL_RCEN_LENGTH                    0x00000001

#define _I2C2CONL_ACKEN_POSITION                 0x00000004
#define _I2C2CONL_ACKEN_MASK                     0x00000010
#define _I2C2CONL_ACKEN_LENGTH                   0x00000001

#define _I2C2CONL_ACKDT_POSITION                 0x00000005
#define _I2C2CONL_ACKDT_MASK                     0x00000020
#define _I2C2CONL_ACKDT_LENGTH                   0x00000001

#define _I2C2CONL_STREN_POSITION                 0x00000006
#define _I2C2CONL_STREN_MASK                     0x00000040
#define _I2C2CONL_STREN_LENGTH                   0x00000001

#define _I2C2CONL_GCEN_POSITION                  0x00000007
#define _I2C2CONL_GCEN_MASK                      0x00000080
#define _I2C2CONL_GCEN_LENGTH                    0x00000001

#define _I2C2CONL_SMEN_POSITION                  0x00000008
#define _I2C2CONL_SMEN_MASK                      0x00000100
#define _I2C2CONL_SMEN_LENGTH                    0x00000001

#define _I2C2CONL_DISSLW_POSITION                0x00000009
#define _I2C2CONL_DISSLW_MASK                    0x00000200
#define _I2C2CONL_DISSLW_LENGTH                  0x00000001

#define _I2C2CONL_A10M_POSITION                  0x0000000A
#define _I2C2CONL_A10M_MASK                      0x00000400
#define _I2C2CONL_A10M_LENGTH                    0x00000001

#define _I2C2CONL_STRICT_POSITION                0x0000000B
#define _I2C2CONL_STRICT_MASK                    0x00000800
#define _I2C2CONL_STRICT_LENGTH                  0x00000001

#define _I2C2CONL_SCLREL_POSITION                0x0000000C
#define _I2C2CONL_SCLREL_MASK                    0x00001000
#define _I2C2CONL_SCLREL_LENGTH                  0x00000001

#define _I2C2CONL_I2CSIDL_POSITION               0x0000000D
#define _I2C2CONL_I2CSIDL_MASK                   0x00002000
#define _I2C2CONL_I2CSIDL_LENGTH                 0x00000001

#define _I2C2CONL_I2CEN_POSITION                 0x0000000F
#define _I2C2CONL_I2CEN_MASK                     0x00008000
#define _I2C2CONL_I2CEN_LENGTH                   0x00000001

#define _I2C2CONL_SIDL_POSITION                  0x0000000D
#define _I2C2CONL_SIDL_MASK                      0x00002000
#define _I2C2CONL_SIDL_LENGTH                    0x00000001

#define _I2C2CON2_DHEN_POSITION                  0x00000000
#define _I2C2CON2_DHEN_MASK                      0x00000001
#define _I2C2CON2_DHEN_LENGTH                    0x00000001

#define _I2C2CON2_AHEN_POSITION                  0x00000001
#define _I2C2CON2_AHEN_MASK                      0x00000002
#define _I2C2CON2_AHEN_LENGTH                    0x00000001

#define _I2C2CON2_SBCDE_POSITION                 0x00000002
#define _I2C2CON2_SBCDE_MASK                     0x00000004
#define _I2C2CON2_SBCDE_LENGTH                   0x00000001

#define _I2C2CON2_SDAHT_POSITION                 0x00000003
#define _I2C2CON2_SDAHT_MASK                     0x00000008
#define _I2C2CON2_SDAHT_LENGTH                   0x00000001

