MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _IOCPUB_IOCPUB9_POSITION                 0x00000009
#define _IOCPUB_IOCPUB9_MASK                     0x00000200
#define _IOCPUB_IOCPUB9_LENGTH                   0x00000001

#define _IOCPUB_IOCPUB10_POSITION                0x0000000A
#define _IOCPUB_IOCPUB10_MASK                    0x00000400
#define _IOCPUB_IOCPUB10_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB11_POSITION                0x0000000B
#define _IOCPUB_IOCPUB11_MASK                    0x00000800
#define _IOCPUB_IOCPUB11_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB12_POSITION                0x0000000C
#define _IOCPUB_IOCPUB12_MASK                    0x00001000
#define _IOCPUB_IOCPUB12_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB13_POSITION                0x0000000D
#define _IOCPUB_IOCPUB13_MASK                    0x00002000
#define _IOCPUB_IOCPUB13_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB14_POSITION                0x0000000E
#define _IOCPUB_IOCPUB14_MASK                    0x00004000
#define _IOCPUB_IOCPUB14_LENGTH                  0x00000001

#define _IOCPUB_IOCPUB15_POSITION                0x0000000F
#define _IOCPUB_IOCPUB15_MASK                    0x00008000
#define _IOCPUB_IOCPUB15_LENGTH                  0x00000001

#define _IOCPUB_CNPUB0_POSITION                  0x00000000
#define _IOCPUB_CNPUB0_MASK                      0x00000001
#define _IOCPUB_CNPUB0_LENGTH                    0x00000001

#define _IOCPUB_CNPUB1_POSITION                  0x00000001
#define _IOCPUB_CNPUB1_MASK                      0x00000002
#define _IOCPUB_CNPUB1_LENGTH                    0x00000001

#define _IOCPUB_CNPUB2_POSITION                  0x00000002
#define _IOCPUB_CNPUB2_MASK                      0x00000004
#define _IOCPUB_CNPUB2_LENGTH                    0x00000001

#define _IOCPUB_CNPUB3_POSITION                  0x00000003
#define _IOCPUB_CNPUB3_MASK                      0x00000008
#define _IOCPUB_CNPUB3_LENGTH                    0x00000001

#define _IOCPUB_CNPUB4_POSITION                  0x00000004
#define _IOCPUB_CNPUB4_MASK                      0x00000010
#define _IOCPUB_CNPUB4_LENGTH                    0x00000001

#define _IOCPUB_CNPUB5_POSITION                  0x00000005
#define _IOCPUB_CNPUB5_MASK                      0x00000020
#define _IOCPUB_CNPUB5_LENGTH                    0x00000001

#define _IOCPUB_CNPUB6_POSITION                  0x00000006
#define _IOCPUB_CNPUB6_MASK                      0x00000040
#define _IOCPUB_CNPUB6_LENGTH                    0x00000001

#define _IOCPUB_CNPUB7_POSITION                  0x00000007
#define _IOCPUB_CNPUB7_MASK                      0x00000080
#define _IOCPUB_CNPUB7_LENGTH                    0x00000001

#define _IOCPUB_CNPUB8_POSITION                  0x00000008
#define _IOCPUB_CNPUB8_MASK                      0x00000100
#define _IOCPUB_CNPUB8_LENGTH                    0x00000001

#define _IOCPUB_CNPUB9_POSITION                  0x00000009
#define _IOCPUB_CNPUB9_MASK                      0x00000200
#define _IOCPUB_CNPUB9_LENGTH                    0x00000001

#define _IOCPUB_CNPUB10_POSITION                 0x0000000A
#define _IOCPUB_CNPUB10_MASK                     0x00000400
#define _IOCPUB_CNPUB10_LENGTH                   0x00000001

#define _IOCPUB_CNPUB11_POSITION                 0x0000000B
#define _IOCPUB_CNPUB11_MASK                     0x00000800
#define _IOCPUB_CNPUB11_LENGTH                   0x00000001

#define _IOCPUB_CNPUB12_POSITION                 0x0000000C
#define _IOCPUB_CNPUB12_MASK                     0x00001000
#define _IOCPUB_CNPUB12_LENGTH                   0x00000001

#define _IOCPUB_CNPUB13_POSITION                 0x0000000D
#define _IOCPUB_CNPUB13_MASK                     0x00002000
#define _IOCPUB_CNPUB13_LENGTH                   0x00000001

#define _IOCPUB_CNPUB14_POSITION                 0x0000000E
#define _IOCPUB_CNPUB14_MASK                     0x00004000
#define _IOCPUB_CNPUB14_LENGTH                   0x00000001

#define _IOCPUB_CNPUB15_POSITION                 0x0000000F
#define _IOCPUB_CNPUB15_MASK                     0x00008000
#define _IOCPUB_CNPUB15_LENGTH                   0x00000001

#define _CNPDB_IOCPDB0_POSITION                  0x00000000
#define _CNPDB_IOCPDB0_MASK                      0x00000001
#define _CNPDB_IOCPDB0_LENGTH                    0x00000001

#define _CNPDB_IOCPDB1_POSITION                  0x00000001
#define _CNPDB_IOCPDB1_MASK                      0x00000002
#define _CNPDB_IOCPDB1_LENGTH                    0x00000001

#define _CNPDB_IOCPDB2_POSITION                  0x00000002
#define _CNPDB_IOCPDB2_MASK                      0x00000004
#define _CNPDB_IOCPDB2_LENGTH                    0x00000001

#define _CNPDB_IOCPDB3_POSITION                  0x00000003
#define _CNPDB_IOCPDB3_MASK                      0x00000008
#define _CNPDB_IOCPDB3_LENGTH                    0x00000001

#define _CNPDB_IOCPDB4_POSITION                  0x00000004
#define _CNPDB_IOCPDB4_MASK                      0x00000010
#define _CNPDB_IOCPDB4_LENGTH                    0x00000001

#define _CNPDB_IOCPDB5_POSITION                  0x00000005
#define _CNPDB_IOCPDB5_MASK                      0x00000020
#define _CNPDB_IOCPDB5_LENGTH                    0x00000001

#define _CNPDB_IOCPDB6_POSITION                  0x00000006
#define _CNPDB_IOCPDB6_MASK                      0x00000040
#define _CNPDB_IOCPDB6_LENGTH                    0x00000001

#define _CNPDB_IOCPDB7_POSITION                  0x00000007
#define _CNPDB_IOCPDB7_MASK                      0x00000080
#define _CNPDB_IOCPDB7_LENGTH                    0x00000001

#define _CNPDB_IOCPDB8_POSITION                  0x00000008
#define _CNPDB_IOCPDB8_MASK                      0x00000100
#define _CNPDB_IOCPDB8_LENGTH                    0x00000001

#define _CNPDB_IOCPDB9_POSITION                  0x00000009
#define _CNPDB_IOCPDB9_MASK                      0x00000200
#define _CNPDB_IOCPDB9_LENGTH                    0x00000001

#define _CNPDB_IOCPDB10_POSITION                 0x0000000A
#define _CNPDB_IOCPDB10_MASK                     0x00000400
#define _CNPDB_IOCPDB10_LENGTH                   0x00000001

#define _CNPDB_IOCPDB11_POSITION                 0x0000000B
#define _CNPDB_IOCPDB11_MASK                     0x00000800
#define _CNPDB_IOCPDB11_LENGTH                   0x00000001

#define _CNPDB_IOCPDB12_POSITION                 0x0000000C
#define _CNPDB_IOCPDB12_MASK                     0x00001000
#define _CNPDB_IOCPDB12_LENGTH                   0x00000001

#define _CNPDB_IOCPDB13_POSITION                 0x0000000D
#define _CNPDB_IOCPDB13_MASK                     0x00002000
#define _CNPDB_IOCPDB13_LENGTH                   0x00000001

#define _CNPDB_IOCPDB14_POSITION                 0x0000000E
#define _CNPDB_IOCPDB14_MASK                     0x00004000
#define _CNPDB_IOCPDB14_LENGTH                   0x00000001

#define _CNPDB_IOCPDB15_POSITION                 0x0000000F
#define _CNPDB_IOCPDB15_MASK                     0x00008000
#define _CNPDB_IOCPDB15_LENGTH                   0x00000001

#define _CNPDB_CNPDB0_POSITION                   0x00000000
#define _CNPDB_CNPDB0_MASK                       0x00000001
#define _CNPDB_CNPDB0_LENGTH                     0x00000001

#define _CNPDB_CNPDB1_POSITION                   0x00000001
#define _CNPDB_CNPDB1_MASK                       0x00000002
#define _CNPDB_CNPDB1_LENGTH                     0x00000001

