MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GB610/mcu.h
#define _IOCFG_IOCFG2_POSITION                   0x00000002
#define _IOCFG_IOCFG2_MASK                       0x00000004
#define _IOCFG_IOCFG2_LENGTH                     0x00000001

#define _IOCFG_IOCFG3_POSITION                   0x00000003
#define _IOCFG_IOCFG3_MASK                       0x00000008
#define _IOCFG_IOCFG3_LENGTH                     0x00000001

#define _IOCFG_IOCFG6_POSITION                   0x00000006
#define _IOCFG_IOCFG6_MASK                       0x00000040
#define _IOCFG_IOCFG6_LENGTH                     0x00000001

#define _IOCFG_IOCFG7_POSITION                   0x00000007
#define _IOCFG_IOCFG7_MASK                       0x00000080
#define _IOCFG_IOCFG7_LENGTH                     0x00000001

#define _IOCFG_IOCFG8_POSITION                   0x00000008
#define _IOCFG_IOCFG8_MASK                       0x00000100
#define _IOCFG_IOCFG8_LENGTH                     0x00000001

#define _IOCFG_IOCFG9_POSITION                   0x00000009
#define _IOCFG_IOCFG9_MASK                       0x00000200
#define _IOCFG_IOCFG9_LENGTH                     0x00000001

#define _IOCFG_IOCFG12_POSITION                  0x0000000C
#define _IOCFG_IOCFG12_MASK                      0x00001000
#define _IOCFG_IOCFG12_LENGTH                    0x00000001

#define _IOCFG_IOCFG13_POSITION                  0x0000000D
#define _IOCFG_IOCFG13_MASK                      0x00002000
#define _IOCFG_IOCFG13_LENGTH                    0x00000001

#define _IOCFG_IOCFG14_POSITION                  0x0000000E
#define _IOCFG_IOCFG14_MASK                      0x00004000
#define _IOCFG_IOCFG14_LENGTH                    0x00000001

#define _IOCFG_IOCFG15_POSITION                  0x0000000F
#define _IOCFG_IOCFG15_MASK                      0x00008000
#define _IOCFG_IOCFG15_LENGTH                    0x00000001

#define _CNPUG_IOCPG0_POSITION                   0x00000000
#define _CNPUG_IOCPG0_MASK                       0x00000001
#define _CNPUG_IOCPG0_LENGTH                     0x00000001

#define _CNPUG_IOCPG1_POSITION                   0x00000001
#define _CNPUG_IOCPG1_MASK                       0x00000002
#define _CNPUG_IOCPG1_LENGTH                     0x00000001

#define _CNPUG_IOCPG2_POSITION                   0x00000002
#define _CNPUG_IOCPG2_MASK                       0x00000004
#define _CNPUG_IOCPG2_LENGTH                     0x00000001

#define _CNPUG_IOCPG3_POSITION                   0x00000003
#define _CNPUG_IOCPG3_MASK                       0x00000008
#define _CNPUG_IOCPG3_LENGTH                     0x00000001

#define _CNPUG_IOCPG6_POSITION                   0x00000006
#define _CNPUG_IOCPG6_MASK                       0x00000040
#define _CNPUG_IOCPG6_LENGTH                     0x00000001

#define _CNPUG_IOCPG7_POSITION                   0x00000007
#define _CNPUG_IOCPG7_MASK                       0x00000080
#define _CNPUG_IOCPG7_LENGTH                     0x00000001

#define _CNPUG_IOCPG8_POSITION                   0x00000008
#define _CNPUG_IOCPG8_MASK                       0x00000100
#define _CNPUG_IOCPG8_LENGTH                     0x00000001

#define _CNPUG_IOCPG9_POSITION                   0x00000009
#define _CNPUG_IOCPG9_MASK                       0x00000200
#define _CNPUG_IOCPG9_LENGTH                     0x00000001

#define _CNPUG_IOCPG12_POSITION                  0x0000000C
#define _CNPUG_IOCPG12_MASK                      0x00001000
#define _CNPUG_IOCPG12_LENGTH                    0x00000001

#define _CNPUG_IOCPG13_POSITION                  0x0000000D
#define _CNPUG_IOCPG13_MASK                      0x00002000
#define _CNPUG_IOCPG13_LENGTH                    0x00000001

#define _CNPUG_IOCPG14_POSITION                  0x0000000E
#define _CNPUG_IOCPG14_MASK                      0x00004000
#define _CNPUG_IOCPG14_LENGTH                    0x00000001

#define _CNPUG_IOCPG15_POSITION                  0x0000000F
#define _CNPUG_IOCPG15_MASK                      0x00008000
#define _CNPUG_IOCPG15_LENGTH                    0x00000001

#define _CNPUG_IOCPUG0_POSITION                  0x00000000
#define _CNPUG_IOCPUG0_MASK                      0x00000001
#define _CNPUG_IOCPUG0_LENGTH                    0x00000001

#define _CNPUG_IOCPUG1_POSITION                  0x00000001
#define _CNPUG_IOCPUG1_MASK                      0x00000002
#define _CNPUG_IOCPUG1_LENGTH                    0x00000001

#define _CNPUG_IOCPUG2_POSITION                  0x00000002
#define _CNPUG_IOCPUG2_MASK                      0x00000004
#define _CNPUG_IOCPUG2_LENGTH                    0x00000001

#define _CNPUG_IOCPUG3_POSITION                  0x00000003
#define _CNPUG_IOCPUG3_MASK                      0x00000008
#define _CNPUG_IOCPUG3_LENGTH                    0x00000001

#define _CNPUG_IOCPUG6_POSITION                  0x00000006
#define _CNPUG_IOCPUG6_MASK                      0x00000040
#define _CNPUG_IOCPUG6_LENGTH                    0x00000001

#define _CNPUG_IOCPUG7_POSITION                  0x00000007
#define _CNPUG_IOCPUG7_MASK                      0x00000080
#define _CNPUG_IOCPUG7_LENGTH                    0x00000001

#define _CNPUG_IOCPUG8_POSITION                  0x00000008
#define _CNPUG_IOCPUG8_MASK                      0x00000100
#define _CNPUG_IOCPUG8_LENGTH                    0x00000001

#define _CNPUG_IOCPUG9_POSITION                  0x00000009
#define _CNPUG_IOCPUG9_MASK                      0x00000200
#define _CNPUG_IOCPUG9_LENGTH                    0x00000001

#define _CNPUG_IOCPUG12_POSITION                 0x0000000C
#define _CNPUG_IOCPUG12_MASK                     0x00001000
#define _CNPUG_IOCPUG12_LENGTH                   0x00000001

#define _CNPUG_IOCPUG13_POSITION                 0x0000000D
#define _CNPUG_IOCPUG13_MASK                     0x00002000
#define _CNPUG_IOCPUG13_LENGTH                   0x00000001

#define _CNPUG_IOCPUG14_POSITION                 0x0000000E
#define _CNPUG_IOCPUG14_MASK                     0x00004000
#define _CNPUG_IOCPUG14_LENGTH                   0x00000001

#define _CNPUG_IOCPUG15_POSITION                 0x0000000F
#define _CNPUG_IOCPUG15_MASK                     0x00008000
#define _CNPUG_IOCPUG15_LENGTH                   0x00000001

#define _CNPUG_CNPUG0_POSITION                   0x00000000
#define _CNPUG_CNPUG0_MASK                       0x00000001
#define _CNPUG_CNPUG0_LENGTH                     0x00000001

#define _CNPUG_CNPUG1_POSITION                   0x00000001
#define _CNPUG_CNPUG1_MASK                       0x00000002
#define _CNPUG_CNPUG1_LENGTH                     0x00000001

#define _CNPUG_CNPUG2_POSITION                   0x00000002
#define _CNPUG_CNPUG2_MASK                       0x00000004
#define _CNPUG_CNPUG2_LENGTH                     0x00000001

